## MPG Cars

In [1]:
#concat()-

In [10]:
import pandas as pd

In [11]:
cars1= pd.read_csv("/Users/Chhimi/Desktop/Data/assignmet_file/cars1.csv", index_col='mpg')
cars1.head()

,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
mpg,,,,,,,,,,,,,
18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [12]:
cars2= pd.read_csv("/Users/Chhimi/Desktop/Data/assignmet_file/cars2.csv", index_col='mpg')
cars2.head()

,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
mpg,,,,,,,,
33.0,4,91,53,1795,17.4,76,3,honda civic
20.0,6,225,100,3651,17.7,76,1,dodge aspen se
18.0,6,250,78,3574,21.0,76,1,ford granada ghia
18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### fix cars1 having some unnamed blanks ie: take only the column except unnamed

In [13]:
cars1= cars1.dropna(axis=1, how="all")
print(cars1.head())

      cylinders  displacement horsepower  weight  acceleration  model  origin  \
mpg
18.0          8           307        130    3504          12.0     70       1
15.0          8           350        165    3693          11.5     70       1
18.0          8           318        150    3436          11.0     70       1
16.0          8           304        150    3433          12.0     70       1
17.0          8           302        140    3449          10.5     70       1

                            car
mpg
18.0  chevrolet chevelle malibu
15.0          buick skylark 320
18.0         plymouth satellite
16.0              amc rebel sst
17.0                ford torino

### What is the number of observations in each dataset?

In [6]:
print()

### Join cars1 and cars2 into a single DataFrame called cars

In [18]:
cars=pd.join(cars1,cars2, on='mpg', how='outer')
cars.head()

AttributeError: module 'pandas' has no attribute 'join'

In [19]:
cars=  pd.concat([cars1, cars2], ignore_index=True)
print(cars.shape)
print(cars[1996:204])

(398, 8)
Empty DataFrame
Columns: [cylinders, displacement, horsepower, weight, acceleration, model, origin, car]
Index: []

### Create a random number Series from 15,000 to 73,000. as owners

In [21]:
np.random.seed(100)
owners=pd.Series(np.random.randint(low=15000, high=73000, size=cars.shape[0]))
owners.describe()

count      398.000000
mean     43922.459799
std      16461.404947
min      15079.000000
25%      29491.000000
50%      43668.500000
75%      57632.000000
max      72987.000000
dtype: float64

### Add the column owners to cars`

In [22]:
cars["owners"]= owners
print(cars.head())

   cylinders  displacement horsepower  weight  acceleration  model  origin  \
0          8           307        130    3504          12.0     70       1
1          8           350        165    3693          11.5     70       1
2          8           318        150    3436          11.0     70       1
3          8           304        150    3433          12.0     70       1
4          8           302        140    3449          10.5     70       1

                         car  owners
0  chevrolet chevelle malibu   53408
1          buick skylark 320   71088
2         plymouth satellite   29147
3              amc rebel sst   72191
4                ford torino   27119

## fictious Names

In [23]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [24]:
data1 = pd.DataFrame(raw_data_1, columns = ['subject_id', 'first_name', 'last_name'])
data2 = pd.DataFrame(raw_data_2, columns = ['subject_id', 'first_name', 'last_name'])
data3 = pd.DataFrame(raw_data_3, columns = ['subject_id','test_id'])

data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Join the two dataframes along rows and assign all_data

In [31]:
all_data=pd.concat([data1, data2])

In [32]:
all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### Join the two dataframes along columns and assing to all_data_col

In [28]:
all_data_col= pd.concat([data1, data2], axis=1)

In [29]:
all_data_col

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

### Merge all_data and data3 along the subject_id value

In [34]:
data_merged= pd.merge(all_data, data3, on = "subject_id", how="outer")
data_merged

   subject_id first_name last_name  test_id
0           1       Alex  Anderson     51.0
1           2        Amy  Ackerman     15.0
2           3      Allen       Ali     15.0
3           4      Alice      Aoni     61.0
4           4      Billy    Bonder     61.0
5           5     Ayoung   Atiches     16.0
6           5      Brian     Black     16.0
7           6       Bran   Balwner      NaN
8           7      Bryce     Brice     14.0
9           8      Betty    Btisan     15.0
10          9        NaN       NaN      1.0
11         10        NaN       NaN     61.0
12         11        NaN       NaN     16.0

### Merge only the data that has the same 'subject_id' on both data1 and data2

In [36]:
same_id= pd.merge(data1, data2, on = "subject_id", suffixes=("_data1", "_data2"))
same_id

  subject_id first_name_data1 last_name_data1 first_name_data2 last_name_data2
0          4            Alice            Aoni            Billy          Bonder
1          5           Ayoung         Atiches            Brian           Black

### Merge all values in data1 and data2, with matching records from both sides where available.

In [37]:
matching_all=pd.merge(data1, data2, on="subject_id", how="outer")

In [38]:
matching_all

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan